Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.ExaggerationOrigins Enumeration
 The origin of the exaggeration.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ExaggerationOrigins
Public Enumeration ExaggerationOrigins
Members
Member name | Value | Description
NearDimensionLine | 1 |  Start the exaggeration close to the dimension line.
NearMeasuredObject | 2 |  Start the exaggeration as soon as possible as seen from the measured part.
See Also
Reference
Tekla.Structures.Drawing Namespace